<template>
    <main class="grid-container grow items-start auto-rows-max">
        <div class="col-[full] max-sm:py-7 grid-container bg-contain text-[#414141] bg-[url(@/assets/img/pattern.svg)] mb-20">
            <div class="flex items-center gap-4">
                <div class="hidden sm:block max-lg:mt-7 max-lg:max-w-[132px]">
                    <img src="@/assets/img/Hero.png" alt="" width="390">
                </div>
                <p class="text-lg sm:text-2xl lg:text-5xl font-bold">Доставка бесплатно от 1000 ₽</p>
            </div>            
        </div>
        <div class="mb-20 sm:mb-[6.25rem] lg:mb-[7.5rem]">
            <div class="flex gap-4 items-end justify-between mb-4 sm:mb-8 lg:mb-10">
                <h2 class="text-2xl lg:text-4xl font-bold text-[#414141]">Акции</h2>
                <a href="#" class="flex gap-2 p-2 min-w-[168px] text-[#606060]"><span class="grow text-center">Все акции</span><img src="@/assets/img/icons/chevron-right.svg" alt=""></a>
            </div>
            <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 sm:gap-8 lg:gap-10">
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-4.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                        <div class="py-1 px-2 rounded bg-[#FF6633] absolute left-2.5 bottom-2.5 text-white">-50%</div>
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">С картой</p>
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060]">44,50 <span class="ml-1">₽</span></p>          
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">Обычная</p>                     
                            </div>                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Г/Ц Блинчики с мясом вес, Россия</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>                   
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-3.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                        <div class="py-1 px-2 rounded bg-[#FF6633] absolute left-2.5 bottom-2.5 text-white">-50%</div>
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">С картой</p>
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060]">44,50 <span class="ml-1">₽</span></p>          
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">Обычная</p>                     
                            </div>                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Молоко ПРОСТОКВАШИНО паст. питьевое цельное отборное</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>                    
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-1.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                        <div class="py-1 px-2 rounded bg-[#FF6633] absolute left-2.5 bottom-2.5 text-white">-50%</div>
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">С картой</p>
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060]">44,50 <span class="ml-1">₽</span></p>          
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">Обычная</p>                     
                            </div>                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Колбаса сырокопченая МЯСНАЯ ИСТОРИЯ Сальчичон и Тоскан</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>                    
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-2.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                        <div class="py-1 px-2 rounded bg-[#FF6633] absolute left-2.5 bottom-2.5 text-white">-50%</div>
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">С картой</p>
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060]">44,50 <span class="ml-1">₽</span></p>          
                                <p class="text-[8px] sm:text-xs text-[#BFBFBF]">Обычная</p>                     
                            </div>                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Сосиски вареные МЯСНАЯ ИСТОРИЯ Молочные и С сыром</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
            </div>
        </div>
        <div class="mb-20 sm:mb-[6.25rem] lg:mb-[7.5rem]">
            <div class="flex gap-4 items-end justify-between mb-4 sm:mb-8 lg:mb-10">
                <h2 class="text-2xl lg:text-4xl font-bold text-[#414141]">Новинки</h2>
                <a href="#" class="flex gap-2 p-2 min-w-[168px] text-[#606060]"><span class="grow text-center">Все новинки</span><img src="@/assets/img/icons/chevron-right.svg" alt=""></a>
            </div>
            <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 sm:gap-8 lg:gap-10">
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-4.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>                                
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>                              
                            </div>                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Г/Ц Блинчики с мясом вес, Россия</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-3.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                               
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Молоко ПРОСТОКВАШИНО паст. питьевое цельное отборное</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-1.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                               
                            </div>
                            <div> 
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                              
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Колбаса сырокопченая МЯСНАЯ ИСТОРИЯ Сальчичон и Тоскан</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-2.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                                
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                               
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Сосиски вареные МЯСНАЯ ИСТОРИЯ Молочные и С сыром</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
            </div>
        </div>
        <div class="mb-20 sm:mb-[6.25rem] lg:mb-[7.5rem]">
            <div class="flex gap-4 items-end justify-between mb-4 sm:mb-8 lg:mb-10">
                <h2 class="text-2xl lg:text-4xl font-bold text-[#414141]">Покупали раньше</h2>
                <a href="#" class="flex gap-2 p-2 min-w-[168px] text-[#606060]"><span class="grow text-center">Все покупки</span><img src="@/assets/img/icons/chevron-right.svg" alt=""></a>
            </div>
            <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 sm:gap-8 lg:gap-10">
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-4.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                               
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                              
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Г/Ц Блинчики с мясом вес, Россия</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-3.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                              
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                              
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Молоко ПРОСТОКВАШИНО паст. питьевое цельное отборное</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-1.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                            
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                                
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Колбаса сырокопченая МЯСНАЯ ИСТОРИЯ Сальчичон и Тоскан</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
                <div class="flex flex-col rounded shadow-[1px_2px_4px_rgba(0,0,0,0.1)] transition-all duration-500 ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] bg-white overflow-hidden group">
                    <div class="relative">
                        <img src="@/assets/img/product/image-2.png" class="w-full object-contain h-40" alt="">
                        <div class="p-2.5 bg-[#F3F2F1] hover:bg-[#FCD5BA] transition-colors ease-linear duration-500 cursor-pointer rounded opacity-50 absolute right-2 top-2">
                            <img src="@/assets/img/icons/heart.svg" alt="">
                        </div>
                      
                    </div>
                    <div class="flex grow flex-col gap-2 p-2">
                        <div class="mb-3 lg:mb-[18px] flex gap-2 justify-between items-end">
                            <div>
                                <p class="text-sm sm:text-lg font-bold text-[#414141]">44,50 <span class="ml-1">₽</span></p>
                            
                            </div>
                            <div>
                                <p class="text-xs sm:text-base text-[#606060] ">44,50 <span class="ml-1">₽</span></p>
                               
                            </div>
                           
                        </div>
                        <p class="text-xs sm:text-base grow text-[#414141] truncate whitespace-normal line-clamp-3 sm:line-clamp-2 ">Сосиски вареные МЯСНАЯ ИСТОРИЯ Молочные и С сыром</p>
                        <div class="flex items-center gap-1">
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#FF6633]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                            <svg aria-hidden="true" class="w-4 h-4 text-[#BFBFBF]" fill="currentColor" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg"><title>First star</title><path d="M6.10326 0.816985C6.47008 0.0737389 7.52992 0.0737404 7.89674 0.816986L9.11847 3.29249C9.26413 3.58763 9.5457 3.7922 9.87141 3.83953L12.6033 4.2365C13.4235 4.35568 13.751 5.36365 13.1575 5.94219L11.1807 7.8691C10.945 8.09884 10.8375 8.42984 10.8931 8.75423L11.3598 11.4751C11.4999 12.292 10.6424 12.9149 9.90881 12.5293L7.46534 11.2446C7.17402 11.0915 6.82598 11.0915 6.53466 11.2446L4.09119 12.5293C3.35756 12.9149 2.50013 12.292 2.64024 11.4751L3.1069 8.75423C3.16254 8.42984 3.05499 8.09884 2.81931 7.8691L0.842496 5.94219C0.248979 5.36365 0.576491 4.35568 1.39671 4.2365L4.12859 3.83953C4.4543 3.7922 4.73587 3.58763 4.88153 3.29249L6.10326 0.816985Z"></path></svg>
                        </div>
                        <Button class="w-full group-hover:outline-[#FF6633] group-hover:bg-[#FF6633] group-hover:text-white" color="secondary" decoration="outline">В корзину</Button>
                    </div>
                </div>
            </div>
        </div>
        <div class="mb-20 sm:mb-[6.25rem] lg:mb-[7.5rem]">
            <h2 class="text-2xl lg:text-4xl font-bold text-[#414141] mb-4 sm:mb-8 lg:mb-10">Новинки</h2>
            <div class="flex gap-4 sm:gap-8 lg:gap-10 max-sm:flex-col">
                <div class="flex-1 overflow-hidden flex gap-2 justify-between items-center p-5 lg:py-7 lg:px-10 rounded bg-[#FCD5BA] transition-shadow duration-500 ease-linear hover:shadow-[0_8px_16px_0_rgba(202,147,96,0.5)] text-[#414141]">
                    <div>
                        <p class="text-xl sm:text-lg lg:text-2xl font-black">Оформите карту «Северяночка»</p>
                        <p class="mt-2.5 text-xs lg:text-base">И получайте бонусы при покупке в магазинах и на сайте</p>
                    </div>
                    <div class="max-lg:-mr-16 shrink-0">
                        <img src="@/assets/img/cartLoyal.png" class="drop-shadow-[0_8px_47px_rgba(200,90,53,0.51)] max-lg:w-40" alt="">
                    </div>
                </div>
                <div class="flex-1 overflow-hidden bg-[url(@/assets/img/bg.svg)] bg-cover flex gap-2 justify-between items-center p-5 lg:py-7 lg:px-10 rounded bg-[#E5FFDE] transition-shadow duration-500 ease-linear hover:shadow-[0_8px_16px_0_rgba(229,225,222,1)] text-[#414141]">
                    <div>
                        <p class="text-xl sm:text-lg lg:text-2xl font-black">Покупайте акционные товары</p>
                        <p class="mt-2.5 text-xs lg:text-base">И получайте вдвое больше бонусов</p>
                    </div>
                    <div class="shrink-0">
                        <img src="@/assets/img/img1.png" alt="" class="max-lg:w-32">
                    </div>
                </div>               
            </div>
        </div>
        <div class="mb-20 sm:mb-[6.25rem] lg:mb-[7.5rem]">
            <h2 class="text-2xl lg:text-4xl font-bold text-[#414141] mb-4 sm:mb-8 lg:mb-10">Наши магазины</h2>
            <div>
                <div class="flex flex-wrap gap-2 mb-4 sm:mb-6">
                    <div class="text-white px-2 py-1 rounded bg-[#70C05B]">п.Щельяюр</div>
                    <div class="text-[#606060] px-2 py-1 rounded bg-[#F3F2F1]">д.Вертеп</div>
                    <div class="text-[#606060] px-2 py-1 rounded bg-[#F3F2F1]">с.Краснобор</div>
                    <div class="text-[#606060] px-2 py-1 rounded bg-[#F3F2F1]">д.Диюр</div>
                </div>
                <div class="h-[354px]"><iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Afedfd8e54883ef3d8dc38a789fe057fd2710aa75a0b2ba76bae56f83ad38ece3&amp;source=constructor" controller="none" class="w-full h-full" frameborder="0"></iframe></div>
            </div>
        </div>
        <div>
            <div class="flex gap-4 items-end justify-between mb-4 sm:mb-8 lg:mb-10">
                <h2 class="text-2xl lg:text-4xl font-bold text-[#414141]">Статьи</h2>
                <a href="#" class="flex gap-2 p-2 min-w-[168px] text-[#606060]"><span class="grow text-center">Все статьи</span><img src="@/assets/img/icons/chevron-right.svg" alt=""></a>
            </div>
            <div class="grid grid-cols-1 min-[600px]:grid-cols-2 lg:grid-cols-3 gap-4 sm:gap-8 lg:gap-10">
                <div class="flex flex-col bg-white transition-all duration-500 rounded overflow-hidden ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] shadow-[1px_2px_4px_rgba(0,0,0,0.1)] group">
                    <div class="h-24 sm:h-[156px] lg:h-[162px]"><img src="@/assets/img/article/image1.png" alt="" class="w-full h-full object-cover object-center"></div>
                    <div class="flex grow flex-col gap-2.5 p-2.5 text-[#414141]">
                        <p class="text-xs text-[#8F8F8F]">05.03.2021</p>
                        <p class="text-lg font-bold">Режим использования масок и перчаток на территории магазинов</p>
                        <p class="grow">Подробная информация о режимах использования масок и перчаток на территории магазинов "ЛЕНТА". Информация обновляется каждый будний день.</p>
                        <a href="#" class="self-start p-2 min-w-[150px] flex items-center justify-center transition-all duration-500 ease-linear group-hover:bg-[#70C05B] group-hover:text-white bg-[#E5FFDE] text-[#70C05B] rounded">Подробнее</a>
                    </div>  
                </div>               
                <div class="flex flex-col bg-white transition-all duration-500 rounded overflow-hidden ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] shadow-[1px_2px_4px_rgba(0,0,0,0.1)] group">
                    <div class="h-24 sm:h-[156px] lg:h-[162px]"><img src="@/assets/img/article/image2.png" alt="" class="w-full h-full object-cover object-center"></div>
                    <div class="flex grow flex-col gap-2.5 p-2.5 text-[#414141]">
                        <p class="text-xs text-[#8F8F8F]">05.03.2021</p>
                        <p class="text-lg font-bold">Весеннее настроение для каждой</p>
                        <p class="grow">8 Марта – это не просто Международный женский день, это ещё день тюльпанов, приятных сюрпризов и праздничных тёплых пожеланий.</p>
                        <a href="#" class="self-start p-2 min-w-[150px] flex items-center justify-center transition-all duration-500 ease-linear group-hover:bg-[#70C05B] group-hover:text-white bg-[#E5FFDE] text-[#70C05B] rounded">Подробнее</a>
                    </div>  
                </div>               
                <div class="flex flex-col bg-white transition-all duration-500 rounded overflow-hidden ease-linear hover:shadow-[4px_8px_16px_rgba(255,102,51,0.2)] shadow-[1px_2px_4px_rgba(0,0,0,0.1)] group">
                    <div class="h-24 sm:h-[156px] lg:h-[162px]"><img src="@/assets/img/article/image3.png" alt="" class="w-full h-full object-cover object-center"></div>
                    <div class="flex grow flex-col gap-2.5 p-2.5 text-[#414141]">
                        <p class="text-xs text-[#8F8F8F]">22.02.2020</p>
                        <p class="text-lg font-bold">ЗОЖ или ФАСТФУД. А вы на чьей стороне? Голосуем!</p>
                        <p class="grow">Голосуйте за любимые категории, выбирайте категорию-победителя в мобильном приложении и получайте кешбэк 10% баллами в апреле!</p>
                        <a href="#" class="self-start p-2 min-w-[150px] flex items-center justify-center transition-all duration-500 ease-linear group-hover:bg-[#70C05B] group-hover:text-white bg-[#E5FFDE] text-[#70C05B] rounded">Подробнее</a>
                    </div>  
                </div>               
            </div>
        </div>
   </main>
</template>

<script setup>
import  Button from "@/components/Button.vue";
</script>


   
   
   
